docs_manual/payout_handling.md
```mermaid
sequenceDiagram 
  participant customer as customer (IPolicyHolder)
  participant product
  participant claimService
  participant poolService
  participant pool as pool (IPolicyHolder)
  pool ->> reinsuranceProduct: applyForPolicy()
 reinsuranceProduct ->> pool: policyActivated()
  product->>claimService: createPayout()
  claimService ->> poolService: requestPayout()
  poolService ->> pool: requestPayout()
  pool ->> pool: getReinsurancePolicy()
  pool ->> reinsuranceProduct: claim()
  reinsuranceProduct ->> pool: claimConfirmed()
  reinsuranceProduct -->> reinsurancePool: createPayout
  reinsurancePool -->> pool: transfer token for payout
  reinsurancePool ->> pool: payoutExecuted()
  pool ->> poolService: processPayout()
  poolService ->> claimService: payoutProcessed()
  pool -->> customer: transfer token for payout
  poolService ->> customer: payoutExecuted()
```
